# IMDB DataSet Analysis

* Importing the Libraries

In [2]:
# Numpy
import numpy as np

# Pandas
import pandas as pd

# MatPlotLib
import matplotlib.pyplot as plt

# Sqlite
import sqlite3 as sql

* Connecting to the DataBase

In [3]:
# db='/content/drive/MyDrive/Projects/IMDB Dataset/movies.sqlite'

# Estabishing connections with the database
db='movies.sqlite'
conn=sql.connect(db)

# Calling Cursor function
cur=conn.cursor()

1. Get all the data's of the movies

In [ ]:
cur.execute("SELECT * FROM movies")

# Fetching all the datas
movies=cur.fetchall()

# Displaying the data
movies

2. Converting data to DataFrame

In [ ]:
# Creating a DataFrame
movies=pd.DataFrame(movies,columns=['id','original_title', 'budget', "popularity", 'release_date', 'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline', 'uid', 'director_id'])

# Displaying the dataframe  
movies

3. Getting information of the dataset

In [82]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4773 entries, 0 to 4772
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              4773 non-null   int64
 1   original_title  4773 non-null   object
 2   budget          4773 non-null   int64
 3   popularity      4773 non-null   int64
 4   release_date    4773 non-null   object
 5   revenue         4773 non-null   int64
 6   title           4773 non-null   object
 7   avg_ratings     4773 non-null   float64
 8   rating_count    4773 non-null   int64
 9   overview        4770 non-null   object
 10  tagline         3951 non-null   object
 11  uid             4773 non-null   int64
 12  director_id     4773 non-null   int64
dtypes: float64(1), int64(7), object(5)
memory usage: 484.9+ KB

4. Get all the data about directors

In [ ]:
# Queried the directors
cur.execute("SELECT * FROM directors")
directors=cur.fetchall()

# Calling the directors var
directors

In [ ]:
# converting the directors data into a DataFrame
directors=pd.DataFrame(directors, columns=["name", "id", "gender", "uid", 'department'])
directors

5. Check how many movies are present in the IMDB table

In [84]:
cur.execute("SELECT COUNT(id) FROM movies")
count=cur.fetchall()
print(f"The number of movies present in the IMDB dataset is {count[0]}")

The number of movies present in the IMDB dataset is (4773,)

6. Find the directors : James Cameron, Luc Besson, John Woo

In [85]:
# cur.execute('''SELECT * FROM directors WHERE name="James Cameron" or name="Luc Besson" or name="John Woo"''')
cur.execute('''SELECT * FROM directors WHERE name in ("James Cameron", "Luc Besson", "John Woo")''')
req_directors=cur.fetchall()
print(f"The three required directors are {req_directors}")

The three required directors are [('James Cameron', 4762, 2, 2710, 'Directing'), ('John Woo', 4893, 2, 11401, 'Directing'), ('Luc Besson', 4949, 2, 59, 'Directing')]

7. Find all the directors with name starting with the word 'Steven'

In [40]:
cur.execute('''SELECT * FROM directors WHERE name LIKE "Steven%"''')
word_starting_directors=cur.fetchall()
print(f"The directors whose name stats with the word 'Steven' are {word_starting_directors}")

The directors whose name stats with the word 'Steven' are [('Steven Spielberg', 4799, 2, 488, 'Directing'), ('Steven Soderbergh', 4909, 2, 1884, 'Directing'), ('Steven Brill', 5013, 2, 32593, 'Directing'), ('Steven Zaillian', 5117, 2, 2260, 'Directing'), ('Steven Quale', 5216, 2, 93214, 'Directing'), ('Steven Seagal', 5221, 2, 23880, 'Directing'), ('Steven E. de Souza', 5390, 2, 1726, 'Directing'), ('Steven Shainberg', 5803, 2, 67795, 'Directing'), ('Steven R. Monroe', 6713, 2, 88039, 'Directing')]

8. Count the female directors (1)

In [45]:
cur.execute('''SELECT COUNT(name) FROM directors WHERE gender=1''')
female_directors_count=cur.fetchall()
print(f"The number of female directors are {female_directors_count[0][0]}")

The number of female directors are 150

9. Find the name of the 10th first women directors

In [ ]:
cur.execute('''SELECT name FROM directors WHERE gender=1''')
female_directors=cur.fetchall()
print(f"The 1st 10th female director is {female_directors[9][0]}")

10. What are the 3 most popular movies

In [66]:
cur.execute('''SELECT original_title FROM movies ORDER BY popularity DESC LIMIT 3''')
popular_movies=cur.fetchall()
print(f"The 3 popular movies are : {popular_movies[0][0]}, {popular_movies[1][0]},{popular_movies[2][0]}")

The 3 popular movies are : Minions, Interstellar,Deadpool

11. What are the 3 most bankable movies

In [137]:
cur.execute('''SELECT original_title FROM movies ORDER BY budget DESC LIMIT 3''')
bankable_movies=cur.fetchall()
print(f"The 3 popular movies are : {bankable_movies[0][0]}, {bankable_movies[1][0]},{bankable_movies[2][0]}")

The 3 popular movies are : Pirates of the Caribbean: On Stranger Tides, Pirates of the Caribbean: At World's End,Avengers: Age of Ultron

12. Find the most awarded Average vote movies since Jan 1st 2000

In [105]:
cur.execute('''SELECT original_title FROM movies WHERE release_date > 2000-01-01 ORDER BY vote_average DESC LIMIT 1''')
most_awarded_avg=cur.fetchall()
print(f"Most awarded average rated movie is {most_awarded_avg[0][0]}")

Most awarded average rated movie is Stiff Upper Lips

13. Which movies were directed by Brenda Chapman?

In [119]:
cur.execute('''SELECT movies.original_title FROM movies 
            INNER JOIN directors
            ON movies.director_id=directors.id
            WHERE directors.name="Brenda Chapman"''')

directed_movies=cur.fetchall()
print(f"The movies(s) which are directed by Brenda Chapman are {directed_movies[0][0]}")

The movies(s) which are directed by Brenda Chapman are Brave

14. Name the director who has directed the most number of movies

In [132]:
cur.execute('''SELECT directors.name FROM directors 
            INNER JOIN movies
            ON movies.director_id=directors.id
            GROUP BY directors.name
            ORDER BY COUNT(movies.original_title) DESC LIMIT 1''')

most_directed_movies=cur.fetchall()
print(f"The director who directed most number of movies is {most_directed_movies[0][0]}")

The director who directed most number of movies is Steven Spielberg

15. Find the name of the director who is most bankable

In [133]:
cur.execute('''SELECT directors.name FROM directors 
            INNER JOIN movies
            ON movies.director_id=directors.id
            GROUP BY directors.name
            ORDER BY SUM(budget) DESC LIMIT 1''')

most_bankable_movies=cur.fetchall()
print(f"The director who directed most bankable is {most_bankable_movies[0][0]}")

The director who directed most bankable is Steven Spielberg

# Budget Analysis

1. Find the top 10 highest Budget making movies

In [143]:
cur.execute('''SELECT * FROM movies ORDER BY budget DESC LIMIT 10''')
top_ten_budget=cur.fetchall()
top_ten__budgetdf=pd.DataFrame(top_ten_budget,columns=['id','original_title', 'budget', "popularity", 'release_date', 'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline', 'uid', 'director_id'])
top_ten__budgetdf

,id,original_title,budget,popularity,release_date,revenue,title,vote_average,vote_count,overview,tagline,uid,director_id
0,43614,Pirates of the Caribbean: On Stranger Tides,380000000,135,2011-05-14,1045713802,Pirates of the Caribbean: On Stranger Tides,6.4,4948,Captain Jack Sparrow crosses paths with a woma...,Live Forever Or Die Trying.,1865,4775
1,43598,Pirates of the Caribbean: At World's End,300000000,139,2007-05-19,961000000,Pirates of the Caribbean: At World's End,6.9,4500,"Captain Barbossa, long believed to be dead, ha...","At the end of the world, the adventure begins.",285,4763
2,43604,Avengers: Age of Ultron,280000000,134,2015-04-22,1405403694,Avengers: Age of Ultron,7.3,6767,When Tony Stark tries to jumpstart a dormant p...,A New Age Has Come.,99861,4769
3,43607,Superman Returns,270000000,57,2006-06-28,391081192,Superman Returns,5.4,1400,Superman returns to discover his 5-year absenc...,None,1452,4772
4,43601,John Carter,260000000,43,2012-03-07,284139100,John Carter,6.1,2124,"John Carter is a war-weary, former military ca...","Lost in our world, found in another.",49529,4766
5,43603,Tangled,260000000,48,2010-11-24,591794936,Tangled,7.4,3330,When the kingdom's most wanted-and most charmi...,They're taking adventure to new lengths.,38757,4768
6,43602,Spider-Man 3,258000000,115,2007-05-01,890871626,Spider-Man 3,5.9,3576,The seemingly invincible Spider-Man goes up ag...,The battle within.,559,4767
7,43610,The Lone Ranger,255000000,49,2013-07-03,89289910,The Lone Ranger,5.9,2311,The Texas Rangers chase down a gang of outlaws...,Never Take Off the Mask,57201,4763
8,43600,The Dark Knight Rises,250000000,112,2012-07-16,1084939099,The Dark Knight Rises,7.6,9106,Following the death of District Attorney Harve...,The Legend Ends,49026,4765
9,43605,Harry Potter and the Half-Blood Prince,250000000,98,2009-07-07,933959197,Harry Potter and the Half-Blood Prince,7.4,5293,"As Harry begins his sixth year at Hogwarts, he...",Dark Secrets Revealed,767,4770

# Revenue Analysis

1. Find top 10 Revenue making movies

In [144]:
cur.execute('''SELECT * FROM movies ORDER BY revenue DESC LIMIT 10''')
top_ten_revenue=cur.fetchall()
top_ten_revenue_df=pd.DataFrame(top_ten_revenue,columns=['id','original_title', 'budget', "popularity", 'release_date', 'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline', 'uid', 'director_id'])
top_ten_revenue_df

,id,original_title,budget,popularity,release_date,revenue,title,vote_average,vote_count,overview,tagline,uid,director_id
0,43597,Avatar,237000000,150,2009-12-10,2787965087,Avatar,7.2,11800,"In the 22nd century, a paraplegic Marine is di...",Enter the World of Pandora.,19995,4762
1,43622,Titanic,200000000,100,1997-11-18,1845034188,Titanic,7.5,7562,"84 years later, a 101-year-old woman named Ros...",Nothing on Earth could come between them.,597,4762
2,43613,The Avengers,220000000,144,2012-04-25,1519557910,The Avengers,7.4,11776,When an unexpected enemy emerges and threatens...,Some assembly required.,24428,4769
3,43625,Jurassic World,150000000,418,2015-06-09,1513528810,Jurassic World,6.5,8662,Twenty-two years after the events of Jurassic ...,The park is open.,135397,4783
4,43641,Furious 7,190000000,102,2015-04-01,1506249360,Furious 7,7.3,4176,Deckard Shaw seeks revenge against Dominic Tor...,Vengeance Hits Home,168259,4794
5,43604,Avengers: Age of Ultron,280000000,134,2015-04-22,1405403694,Avengers: Age of Ultron,7.3,6767,When Tony Stark tries to jumpstart a dormant p...,A New Age Has Come.,99861,4769
6,43721,Frozen,150000000,165,2013-11-27,1274219009,Frozen,7.3,5295,Young princess Anna of Arendelle dreams about ...,Only the act of true love will thaw a frozen h...,109445,4844
7,43628,Iron Man 3,200000000,77,2013-04-18,1215439994,Iron Man 3,6.8,8806,When Tony Stark's world is torn apart by a for...,Unleash the power behind the armor.,68721,4784
8,44143,Minions,74000000,875,2015-06-17,1156730962,Minions,6.4,4571,"Minions Stuart, Kevin and Bob are recruited by...","Before Gru, they had a history of bad bosses",211672,5045
9,43623,Captain America: Civil War,250000000,198,2016-04-27,1153304495,Captain America: Civil War,7.1,7241,"Following the events of Age of Ultron, the col...",Divided We Fall,271110,4781